In [1]:
import env
import pandas as pd

In [9]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [ ]:
def get_db_url():
    url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [14]:
df_employees = pd.read_sql('select * from employees limit 5', url)
df_employees

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [ ]:
# Intentionally make a typo in db url

OperationalError: (pymysql.err.OperationalError) 
(1044, "Access denied for user 'oneil_2095'@'%' to database 'employees1'")
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [12]:
# Intentionally make an error in your SQL query

ProgrammingError: (pymysql.err.ProgrammingError) 
(1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '5' at line 1")
[SQL: select * from employees liimit 5]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [46]:
# Read the employees and titles tables into two separate DataFrames

df_employees = pd.read_sql('select * from employees limit 5', url)
df_employees

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [15]:
url_tables = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [26]:
df_titles = pd.read_sql('select * from titles limit 5', url)
df_titles

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [ ]:
# How many rows and columns do you have in each DataFrame? Is that what you expected?

employees
6 columns
5 rows


Yes.

In [30]:
# Display the summary statistics for each DataFrame.

df_titles.value_counts(), df_employees.value_counts()

(emp_no  title            from_date   to_date
 10001   Senior Engineer  1986-06-26  9999-01-01    1
 10002   Staff            1996-08-03  9999-01-01    1
 10003   Senior Engineer  1995-12-03  9999-01-01    1
 10004   Engineer         1986-12-01  1995-12-01    1
         Senior Engineer  1995-12-01  9999-01-01    1
 dtype: int64,
 emp_no  birth_date  first_name  last_name  gender  hire_date
 10001   1953-09-02  Georgi      Facello    M       1986-06-26    1
 10002   1964-06-02  Bezalel     Simmel     F       1985-11-21    1
 10003   1959-12-03  Parto       Bamford    M       1986-08-28    1
 10004   1954-05-01  Chirstian   Koblick    M       1986-12-01    1
 10005   1955-01-21  Kyoichi     Maliniak   M       1989-09-12    1
 dtype: int64)

In [37]:
df_titles.info(), df_employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   emp_no     5 non-null      int64
 1   title      5 non-null      object
 2   from_date  5 non-null      object
 3   to_date    5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_no      5 non-null      int64
 1   birth_date  5 non-null      object
 2   first_name  5 non-null      object
 3   last_name   5 non-null      object
 4   gender      5 non-null      object
 5   hire_date   5 non-null      object
dtypes: int64(1), object(5)
memory usage: 368.0+ bytes

(None, None)

In [52]:
# How many unique titles are in the titles DataFrame
df_titles['title'].value_counts()

Senior Engineer    3
Staff              1
Engineer           1
Name: title, dtype: int64

In [50]:
# What is the oldest date in the to_date column

df_titles.sort_values(by=['to_date']).head(1)

   emp_no     title   from_date     to_date
3   10004  Engineer  1986-12-01  1995-12-01

In [51]:
# What is the most recent date in the to_date column?

df_titles.sort_values(by=['to_date']).tail(1)

   emp_no            title   from_date     to_date
4   10004  Senior Engineer  1995-12-01  9999-01-01